Revit 2027 API
FabricSheetType.IsValidMinorLapSplice Method
 Identifies if the input value is valid to be applied as the minor lap splice value for this FabricSheetType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMinorLapSplice(
	double minorLapSplice
)
Public Function IsValidMinorLapSplice (
	minorLapSplice As Double
) As Boolean
public:
bool IsValidMinorLapSplice(
	double minorLapSplice
)
member IsValidMinorLapSplice :
        minorLapSplice : float -> bool
Parameters
minorLapSplice Double
Return Value
Boolean
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace